---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFilterType.NotEqual
enum: Autodesk.Revit.DB.ScheduleFilterType
source: html/9b696f55-de40-8739-8cfb-decd51995cff.htm
---
# Autodesk.Revit.DB.ScheduleFilterType.NotEqual

The field value is not equal to the specified value.